In [1]:
import pandas as pd

In [2]:
data = [[1, 'Wang', 'Allen'], [2, 'Alice', 'Bob']]
person = pd.DataFrame(data, columns=['personId', 'firstName', 'lastName']).astype({'personId':'Int64', 'firstName':'object', 'lastName':'object'})
data = [[1, 2, 'New York City', 'New York'], [2, 3, 'Leetcode', 'California']]
address = pd.DataFrame(data, columns=['addressId', 'personId', 'city', 'state']).astype({'addressId':'Int64', 'personId':'Int64', 'city':'object', 'state':'object'})

In [4]:
person

   personId firstName lastName
0         1      Wang    Allen
1         2     Alice      Bob

In [5]:
address

   addressId  personId           city       state
0          1         2  New York City    New York
1          2         3       Leetcode  California

In [20]:
person.merge(right=address, left_on='personId', right_on='personId', how='left')[['firstNam','lastName','city', 'state']]

   personId firstName lastName  addressId           city       state
0         1      Wang    Allen       <NA>            NaN         NaN
1         2     Alice      Bob          1  New York City    New York
2         3       NaN      NaN          2       Leetcode  California